Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/dismissal/unfair_dismissal.html.txt.tmx
Source language: en
Languages: ga

source: Under the Unfair Dismissals Acts 1977–2015 circumstances in which unfair dismissal can occur are where:
ga: Faoi na hAchtanna um Dhífhostú Éagórach 1977-2015 'siad na cúinsí inar féidir le dífhostú éagórach tarlú ná nuair:

source: • Your employer terminates your contract of employment, with or without notice or
ga: • Cuireann d'fhostóir deireadh le do chonradh fostaíochta, le nó gan fógra nó

source: • You terminate your contract of employment, with or without notice, due to the conduct of your employer
ga: • Cuireann tú deireadh le do chonradh fostaíochta, le nó gan fógra, toisc iompraíocht d'fhostóir

source: This is known as constructive dismissal
ga: Dífhostú inchiallaithe a ghlaoitear ar seo

source: If you are dismissed from your employment, you may, under certain conditions, bring a claim for unfair dismissal against your employer
ga: Má tá tú dífhostaithe ó do chuid fostaíochta, d'fhéadfá, faoi choinníollacha áirithe, éileamh ar dhífhostú éagórach a dhéanamh i gcoinne d'fhostóir

source: The unfair dismissals legislation does not actually protect you from dismissal, rather it provides a system of appeal whereby you can question the fairness of your dismissal after it has occurred
ga: Ní dhéanann reachtaíocht um dhífhostú éagórach ann féin tú a chosaint ó dhífhostú, ach soláthraítear córas achomhairc inar féidir leat cothroime an dífhostaithe s'agat a cheistiú tar éis dó tarlú

source: You will have to show that you qualify to bring a claim under the legislation - see 'Rules' below
ga: Beidh ort a léiriú go bhfuil tú incháilithe éileamh a dhéanamh faoin reachtaíocht (féach Rialacha thíos)

source: If you do this and your employer accepts that there was a dismissal, it will be for your employer to show that there were fair grounds for the dismissal
ga: Má dhéanann tú seo agus go nglacann d'fhostóir go raibh dífhostú ann, beidh dualgas ar an bhfostóir a léiriú go raibh cúiseanna córa don dífhostú

source: Apart from a case involving constructive dismissal, a dismissal is presumed to be unfair unless your employer can show substantial grounds to justify it
ga: Lasmuigh de chás lena mbaineann dífhostú inchiallaithe, ceaptar go bhfuil dífhostú éagórach murar féidir cúiseanna maithe a thabhairt leis

source: Under the legislation you may ask your employer for a written statement of the reasons for your dismissal
ga: Faoin reachtaíocht, is féidir leat ráiteas scríofa a iarraidh ar d'fhostóir maidir le cúiseanna an dífhostaithe s'agat

source: Your employer should provide this within 14 days of your request
ga: Ba chóir don fhostóir s'agat é seo a sholáthar laistigh de 14 lá ó d'iarratas a fháil

source: If you are found to have been unfairly dismissed you may be placed back in your job or, more commonly, you may receive compensation for the loss of earnings caused by the dismissal
ga: Má fheictear gur dífhostaíodh tú go héagórach, d'fhéadfaí tú a chur ar ais sa phost nó, rud atá níos comónta, d'fhéadfá cúiteamh a fháil ar an gcaillteanas ioncaim de thoradh an dífhostaithe

source: A dismissal is considered to be automatically unfair if the employee is dismissed for any of the following reasons:
ga: Meastar go bhfuil cúiseanna áirithe do dhífhostú éagórach sa ghnáthchúrsa. Ina measc:

source: • Membership or proposed membership of a trade union or engaging in trade union activities, whether within permitted times during work or outside of working hours
ga: • Ballraíocht ag an bhfostaí, nó tá ballraíocht a bheith ar intinn aige/aici, de cheardchumann nó gníomhaíocht in imeachtaí ceardchumainn,

source: • Religious or political opinions
ga: • Tuairimí creidimh nó polaitiúla

source: • Legal proceedings against an employer where an employee is a party or a witness
ga: • Imeachtaí dlíthiúla in aghaidh fostóra nuair atá an fostaí mar pháirtí nó finné

source: • Race, colour, sexual orientation, age or membership of the Traveller community
ga: • Cine, dath, claonadh gnéis,aois nó duine den Lucht Siúil

source: • Pregnancy, giving birth or breastfeeding or any matters connected with pregnancy or birth
ga: • Toircheas, saolú linbh nó tabhairt chun cíche nó aon rud a bhaineann le toircheas nó breith

source: • Availing of rights under legislation to maternity leave, adoptive leave, paternity leave, carer's leave, parental or force majeure leave
ga: • saoire altramais, saoire atharthachta, saoire cúramóra, saoire thuismitheora nó saoire force majeure

source: • Making a protected disclosure under the Protected Disclosures Act 2014
ga: • Ag déanamh nochtadh cosanta faoin Acht um Nochtadh Cosanta 2014

source: Under the unfair dismissals legislation, redundancy is considered to be a fair ground for dismissal
ga: Faoin reachtaíocht um dhífhostú éagórach ceaptar gur cúis maith le dífhostú í iomarcaíocht

source: However although a redundancy situation exists, you may have grounds for complaint if the manner of your selection for redundancy was unfair
ga: Cé go bhfuil iomarcaíocht i gceist, seans go mbeidh de cheart agat gearán a dhéanamh má roghnaíodh thú go héagórach

source: You may qualify to bring a claim for unfair dismissal if you consider that you were unfairly selected for redundancy or consider that a genuine redundancy situation did not exist – see ‘How to apply’ below
ga: Dá gceapann tú go mbeadh tú dífhostaithe éagórach d'fhéadfá bheith incháilithe chun éileamh ar dhífhostú éagórach a dhéanamh

source: Unless your employer can prove there was a genuine redundancy situation and that fair procedures were followed, your dismissal may be found to be unfair
ga: Ceaptar go bhfuil dífhostú éagórach murar féidir le d’fhostóir cúis iomarcaíochta dhílis agus nósanna imeachta maithe a thabhairt leis

source: If you make a claim for unfair dismissal, you cannot also claim redundancy
ga: Má chuireann tú isteach ar chúiteamh le haghaidh dífhostaithe éagóraigh ní féidir cuir isteach le haghaidh iomarcaíochta

source: In order to qualify to bring a claim for unfair dismissal under the legislation the following requirements must be met:
ga: Ionas go gcáileofaí éileamh a dhéanamh ar dhífhostú éagórach faoin reachtaíocht caithfear na riachtanais a leanas a bhaint amach:

source: The time limit for beginning a claim for unfair dismissal is 6 months from the date of the dismissal
ga: 'Sí an teorainn ama chun éileamh a thosú ar dhífhostú éagórach ná sé mhí ó dháta an dífhostaithe

source: If there is reasonable cause you may be allowed to extend this period up to 12 months from the date of dismissal
ga: Má tá cúinsí réasúnacha, d'fhéadfaí go mbeadh cead agat an tréimhse seo a leathnú go 12 mí ó dháta an dífhostaithe

source: However, this must be reasonable cause - saying you did not know the law will not suffice
ga: Cibé ar bith, is gá gur cúinsí réasúnacha a bheadh i gceist - ní leor a rá nach raibh an dlí ar eolas agat

source: The date of dismissal, under the unfair dismissals legislation, is the date on which the notice to which you are entitled expires
ga: Is é dáta an dífhostaithe, faoin reachtaíocht um dhífhostú éagórach, an dáta deiridh den fhógra a bhfuil tú i dteideal

source: You are entitled to a statutory minimum period of notice if you have worked at least 13 weeks for your employer
ga: Tá tú i dteideal íostréimhse fógra reachtúil má tá tú tar éis oibriú ar feadh 13 seachtainí ar a laghad don fhostóir s'agat

source: Your written contract of employment may provide for a longer period of notice
ga: D'fhéadfadh do chonradh scríofa fostaíochta soláthar a dhéanamh do thréimhse fógra níos faide

source: Normally you must have at least 12 months' continuous service with your employer in order to bring a claim for unfair dismissal
ga: Go hiondúil, caithfidh tú ar a laghad 12 mí de sheirbhís leanúnach le d'fhostóir a bheith agat chun éileamh a dhéanamh ar dhífhostú éagórach

source: However there are important exceptions to this general rule
ga: Cibé ar bith tá eisceachtaí tábhachtacha leis an riail ghinearálta seo

source: If you have less than 12 months' continuous service you may bring a claim for unfair dismissal if you are dismissed for:
ga: Má tá níos lú ná 12 mí de sheirbhís leanúnach agat d'fhéadfá éileamh maidir le dhífhostú éagórach a dhéanamh má dhífhostaítear tú toisc:

source: • Trade union membership or activity
ga: • Ballraíocht nó gníomhaíocht i gceardchumann

source: • Availing of rights granted by the Maternity Protection Acts 1994 and 2004, the Adoptive Leave Acts 1995 and 2005, the Paternity Leave and Benefit Act 2016 the National Minimum Wage Act 2000, the Parental Leave Acts 1998 and 2006 and the Carer's Leave Act 2001
ga: • Ag baint leasa as na cearta deonaithe ag na hAchtanna um Chosaint Mháithreachais 1994 agus 2004, na hAchtanna um Shaoire Uchtaíoch 1995 agus 2005, an tAcht um Shaoire agus Sochar Atharthachta 2016, an tAcht um Pá Íosta Náisiúnta 2000, an tAcht um Shaoire Tuismitheora 1998 agus 2006 agus an tAcht um Saoire Cúramóra 2001

source: Note: employment equality legislation prohibits dismissal based on any of the following 9 grounds for discrimination: gender, civil status, family status, age, disability, religious belief, race, sexual orientation or membership of the Traveller community
ga: Nóta: faoin reachtaíocht comhionannais fostaíocht a ní féidir le fostóir aon duine a roghnú ar son dífhostaithe ar aon cheann den naoi gcúis leatroma seo a leanas: gnéas, stádas sibhialta, stádas teaghlaigh, aois, míchumas, creideamh, cine, claonadh gnéis nó duine den Lucht Siúil

source: So, for example, if you have been employed for less than a year you may not be able to bring a claim under the unfair dismissals legislation, but you may be able make a complaint of discriminatory dismissal - see 'How to apply' below
ga: Mar sin, cuir i gcás go raibh tú fostaithe ar feadh níos lú ná bliain, d'fhéadfadh nach mbeifeá a bheith in ann éileamh a dhéanamh faoin reachtaíocht dífhostaithe éagóracha , ach d'fhéadfá é a dhéanamh faoi reachtaíocht comhionannais - féach 'Conas iarratas a dhéanamh' thíos

source: In general, the continuity of an employee's employment is only broken by the dismissal of the employee by the employer or the termination of the employment by the employee
ga: Go ginearálta, ní bhristear leanúnachas fostaíochta an fhostaí ach amháin trí dhífhostú an fhostaí ón bhfostóir nó foirceannadh na fostaíochta ón bhfostaí

source: You must be an employee, working under a contract of service
ga: Caithfidh tú a bheith i d'fhostaí, ag obair faoi chonradh seirbhíse

source: The essential element of such a contract is that the relationship is one of employer/employee, as opposed to a contract for services where the relationship involves performing a service in return for payment, that is, a contractor
ga: 'Sí an eilimint is riachtanaí de chonradh mar seo ná gur caidreamh fostóir/fostaí atá i gceist, seachas conradh do sheirbhísí nuair a bhaineann an caidreamh le seirbhís a chomhlíonadh ar íocaíocht , i.e

source: In the case of agency employees, for the purpose of redress under the Acts, the employer is the person or organisation for whom the employee is actually working
ga: conraitheoir. I gcás iad siúd atá oibrithe gníomhaireachta, 'siad an fostóir iarbhír an fostóir ar chuspóirí sásaimh faoi na hAchtanna

source: You must have been dismissed in order to bring a claim
ga: Caithfidh gur dífhostaíodh tú ionas gur féidir leat éileamh a dhéanamh

source: The one exception to this is the concept of constructive dismissal where you resign but claim that your employer's conduct towards you forced your resignation
ga: An taon eisceacht amháin dó seo ná coincheap an dífhostaithe inchiallaithe nuair a éiríonn tú as, ach go ndéanann tú éileamh go raibh iompraíocht d'fhostóir i do threo ar an gcúis gur cuireadh brú ort éirí as

source: If your employer disputes that a dismissal actually took place, you will have to establish that it did
ga: Má shéanann d'fhostóir gur tharla dífhostú i bhfírinne, beidh ort a bhunú gur tharla

source: Only then will your claim continue to the next stage of deciding whether the dismissal was fair, which is a matter for your employer to prove
ga: Ní leanfaidh d'éileamh ar aghaidh go dtí an chéad staid eile maidir le cinneadh a dhéanamh an raibh an dífhostú cothrom nó nach raibh go dtí go ndeimhnítear an méid seo, agus caithfidh d'fhostóir an cheist seo a chruthú

source: The Acts do not apply to the following:
ga: Ní bhaineann na hAchtanna leis na daoine a leanas:

source: (a) an employee who is under 16, or who has reached normal retiring age or who is not covered by the Redundancy Payments Acts because of age
ga: (a) fostaí atá faoi 16, nó atá tar éis an gnáthaois scoir a shroicheadh nó nach bhfuil clúdaithe faoi na hAchtanna um Íocaíochtaí Iomarcaíochta toisc cúinsí aoise

source: (b) a person working for a close relative in a private house or farm, provided both also live in the same house or farm;
ga: (b) duine atá ag obair do dhuine gaolta i dteach príobháideach nó feirm, chomh fada agus go gcónaíonn an bheirt sa teach nó feirm céanna chomh maith;

source: (c) a member of the Defence Forces
ga: (c) ball d'Óglaigh na hÉireann

source: (d) a member of the Garda Síochána (since 4 July 2006, the Acts apply to most State employees)
ga: (d) ball den Gharda Síochána (ó 4 Iúil 2006 bhaineann na hActanna leis an cuid is mó do fostaí Stáit)

source: (e) a person undergoing full-time training or apprenticeship
ga: (e) duine atá i mbun oiliúna lánaimseartha nó printíseacht le FÁS

source: (f) an officer of education and training boards, a county or city manager and the chief executive of the Health Service Executive
ga: (f) oifigeach de chuid na mboird oideachais agus oiliúna, bainisteoir contae nó cathrach, agus an príomhfheidhmeannach don Fheidhmeannacht na Seirbhíse Sláinte

source: (g) an employee who is employed under a fixed-term/specified-purpose contract and where the contract is in writing, is signed by both parties and contains a clause that the Acts shall not apply in relation to a dismissal consisting only of the expiration of the fixed term contract or the completion of the specified purpose
ga: (g) fostaí atá fostaithe faoi chonradh ar théarma seasta/cuspóir-shonraithe agus nuair atá an conradh i scríbhinn, sínithe ag an dá phairtí agus a chuimsíonn foráil nach mbainfidh na hAchtanna maidir le dífhostú, a chuimsíonn dáta éagtha an chonartha ar théarma seasta nó comhlánú an chuspóir-shonraithe

source: You can find out detailed information about fixed-term/specified-purpose contracts and dismissal in 'Further information' below
ga: Léigh 'Tuilleadh eolais' thíos faoi chonarthaí ar théarma seasta/cuspóir-shonraithe agus dífhostú

source: (h) an employee who works outside the State (unless the employee is resident in the State for the duration of the contract or is domiciled in the State and the employer is resident in the State for the duration of the contract)
ga: (h) fostaí a oibríonn lasmuigh den Stát (murach go bhfuil an fostaí cónaitheach sa Stát le linn tréimhse an chonartha nó gnáthchónaí air/uirthi sa Stát agus go bhfuil an fostóir cónaitheach sa Stát le linn tréimhse an chonartha)

source: (i) statutory apprentices who are dismissed within 6 months after beginning apprenticeship or within one month after the completion of the apprenticeship
ga: (i) printíseachtaí reachtúla atá dífhostaithe laistigh de sé mhí tar éis printíseacht a thosú nó laistigh de mhí ó chomhlánú na printíseachta

source: (j) an employee who is on probation or undergoing training at the beginning of employment, provided that the duration of probation or training is one year or less and is specified in the written contract of employment
ga: (j) fostaí atá ar promhadh nó i mbun oiliúna ag tús fostaíochta, chomh fada agus go bhfuil tréimhse an phromhaidh nó na hoiliúna bliain amháin nó níos lú agus sonraithe i gconradh scríofa fostaíochta

source: (k) an employee who is dismissed during training for qualification or registration as a nurse or for other specified para-medical employment
ga: (k) fostaí atá dífhostaithe le linn oiliúna do cháilíocht nó do chlárú mar altra nó d'fhostaíocht sonraithe eile paraimhíochaine

source: Note: The exclusions from the Acts of persons referred to in points (b), (e), (i), (j) and (k) shall not apply where the dismissal results from:
ga: Nóta: Ní bhaineann na heisiaimh ó na hAchtanna le daoine a thagraítear dóibh sna pointí (b), (e), (i), (j) agus (k) nuair a tharlaíonn dífhostaithe de bharr:

source: • The employee's pregnancy, giving birth or breastfeeding
ga: • Toircheas an fhostaí, breith linbh nó beathú cíche

source: • Availing of rights under the Maternity Protection Acts 1994 and 2004
ga: • Ag baint leasa as na cearta faoi na hAchtanna um Chosaint Mháithreachais 1994 agus 2004

source: • Availing of rights to adoptive leave or additional adoptive leave, paternity leave, parental leave, force majeure leave or carer's leave
ga: • Ag baint leasa as do chearta do shaoire uchtaíoch nó saoire uchtaíoch bhreise, saoire atharthachta, saoire thuismitheora, saoire force majeure nó saoire cúramóra

source: The exclusion from the Acts of persons referred to in points (a) and (d) shall not apply where the dismissal results from the employee availing of the right to parental leave, force majeure leave or carer's leave
ga: Ní bhainfidh an eisiamh ó na hAchtanna le daoine a thagraítear dóibh i bpointí (a) agus (d) nuair atá an dífhostú de thoradh ar fhostaí ag baint leasa as an gceart do shaoire tuismitheora, saoire force majeure nó saoire cúramóra

source: The exclusion from the Acts of persons referred to in points (d) and (e) shall not apply where the dismissal results from the employee making a protected disclosure
ga: Ní bhainfidh an t-eisiamh ó na hAchtanna le daoine a thagraítear dóibh i bpointí (d) agus (e) nuair atá an dífhostú de thoradh ar fhostaí ag déanamh nochtadh cosanta

source: The Unfair Dismissals Acts will not apply to a dismissal where the employee's employer at the commencement of the employment informs the employee in writing that the employment will terminate on the return to work with that employer of another employee who is absent from work while on maternity leave, adoptive leave, paternity leave or carer's leave
ga: Ní bhainfidh na hAchtanna um Dhífhostú Éagórach le dífhostú nuair a insíonn fostóir an fhostaí don fhostaí i scríbhinn ag tús na fostaíochta go mbeidh deireadh leis an bhfostaíocht ar fhilleadh chun na hoibre leis an bhfostóir sin d'fhostaí eile atá as láthair nuair atá siad ar shaoire mháithreachais, saoire uchtaíoch, saoire atharthachta nó saoire cúramóra

source: If you are successful in your claim for unfair dismissal, the body that heard your claim may award you one of the following remedies:
ga: Má tá rath ar an éileamh s'agat ar dhífhostú éagórach, d'fhéadfadh an foras a d'éist le d'éileamh ceann de na leigheasanna a leanas a bhronnadh ort:

source: This means that you are treated as if you had never been dismissed
ga: Ciallaíonn sé seo go ndéileáiltear leat amhail is nár dífhostaíodh tú riamh

source: Not only are you entitled to loss of earnings from the date of the dismissal to the date of the hearing, you are also entitled to any favourable changes in the terms of employment during that period, for example, pay rises
ga: Ní hamháin go bhfuil tú i dteideal do chaillteanas ioncaim ó dháta na dífhostaithe go dtí dáta na héisteachta, tá tú i dteideal chomh maith d'aon athruithe fabharacha le linn an tréimhse sin, mar shampla, arduithe pá

source: This remedy is rarely used
ga: Is annamh a úsáidtear an leigheas seo

source: This means that you will be given your job back but only from a particular date, for example, the date of the decision in your favour
ga: Ciallaíonn sé seo go dtabharfar do phost ar ais duit ach díreach ó dháta áirithe, mar shampla, dáta an chinnidh i d'fhabhar

source: This means that you will not be entitled to compensation for any loss of earnings
ga: Ciallaíonn sé seo nach mbeidh tú i dteideal do chúiteamh ar aon chaillteanas ioncaim

source: Often this remedy is used where it is felt that the employee contributed to the dismissal, even though the actual dismissal was unfair
ga: Úsáidtear an leigheas seo go minic nuair a airítear gur chuir an fostaí leis an dífhostú, cé go raibh an dífhostú ann féin éagórach

source: Again, however, this remedy is rarely used
ga: Arís, cibé ar bith, is annamh a úsáidtear an réiteach seo

source: This is the most common remedy
ga: Seo é an leigheas is comónta

source: It is essential to note that compensation is only awarded in respect of financial loss
ga: Tá sé riachtanach a nótáil nach mbronntar cúiteamh ach amháin maidir le caillteanas airgid

source: Generally, the maximum compensation is 2 years’ pay
ga: De ghnáth, is an uaschúiteamh é 2 bhliain phá

source: If you were dismissed for making a protected disclosure, the maximum is 5 years’ pay
ga: Má tá tú dífhostaithe mar gheall ar nochtadh cosanta, is an uaschúiteamh é 5 bhliain phá

source: You cannot claim any compensation for such matters as injury to your feelings or stress caused by the dismissal
ga: Ní féidir leat dá réir éileamh a dhéanamh ar chúiteamh do cheisteanna díobhála do na mothúcháin s'agat nó strus ag eascairt ón dífhostú

source: Compensation will take the following matters into account:
ga: Tógfaidh cúiteamh na ceisteanna a leanas san áireamh:

source: • Present loss - a calculation of your loss of earnings from the date of the dismissal to the hearing of your claim
ga: • Caillteanas láithreach - ríomh ar do chaillteanas ioncaim ó dháta na dífhostaithe go dtí an dáta a éistítear le d'éileamh

source: Any money earned by you during this period will be deducted, as will any payment in lieu of notice received by you when you were dismissed
ga: Déanfar aon airgead atá tuillte agat le linn an tréimhse seo a asbhaint, mar a bheidh aon íocaíocht d'fhógra a d'aimsigh tú nuair a dífhostaíodh tú

source: You are also obliged to lessen your losses during the period from your dismissal to the hearing by being available for and seeking alternative employment
ga: Tá dualgas ort do chuid caillteanais a mhaolú le linn an tréimhse ó do dhífhostú go dtí an éisteacht trí 'bheith ar fáil agus a bheith ag cuardach fostaíochta malartach

source: If it transpires that you have no actual loss, because, for example, you took up other employment immediately after your dismissal, you are entitled to a token compensation of 4 weeks' pay
ga: Má tharlaíonn sé nár bhain aon chaillteanas ann féin duit, toisc, mar shampla, gur thóg tú fostaíocht suas díreach tar éis an dífhostaithe s'agat, tá tú i dteideal do chúiteamh comharthach de phá ceithre seachtainí

source: • Future loss - a calculation will be made as to your future loss, based on a consideration of how long it is likely to be before you can get alternative work
ga: • Caillteanas todhchaíoch - déanfar ríomh maidir le do chaillteanas todhchaíoch, bunaithe ar cé chomh fada agus a cheaptar a bheidh sé roimh a thagann tú ar obair mhalartach

source: • Pension loss - a calculation that will try to assess what impact the unfair dismissal has had on your pension entitlements
ga: • Caillteanas pinsean - ríomh a dhéanfaidh iarracht measúnú a dhéanamh ar éifeacht an dífhostaithe éagorach ar do theidlíochtaí pinsean

source: • Loss of statutory protection - a calculation dealing with the point that you will have lost protection under the unfair dismissals, redundancy and minimum notice legislation
ga: • Caillteanas ar chosaint reachtúil - ríomh ag déileáil leis an bpointe go mbeidh cosaint caillte agat faoi dhífhostaithe éagóracha, iomarcaíocht agus reachtaíocht an fhógra íostréimhse
